Simple test 
```
Terraform used the selected providers to generate the following execution plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # awscc_pcs_compute_node_group.login will be created
  + resource "awscc_pcs_compute_node_group" "login" {
      + ami_id                   = "ami-0806233239aed8761"
      + arn                      = (known after apply)
      + cluster_id               = "pcs_xg3mmgdci7"
      + compute_node_group_id    = (known after apply)
      + custom_launch_template   = {
          + template_id = "lt-08f5c327aee3a02fd"
          + version     = "1"
        }
      + error_info               = (known after apply)
      + iam_instance_profile_arn = "arn:aws:iam::204034886740:instance-profile/AWSPCS-PCS-get-started-cfn-us-east-1"
      + id                       = (known after apply)
      + instance_configs         = [
          + {
              + instance_type = "c6i.xlarge"
            },
        ]
      + name                     = "logintest"
      + purchase_option          = (known after apply)
      + scaling_configuration    = {
          + max_instance_count = 1
          + min_instance_count = 1
        }
      + slurm_configuration      = (known after apply)
      + spot_options             = (known after apply)
      + status                   = (known after apply)
      + subnet_ids               = [
          + "subnet-0738f849d594c1822",
          + "subnet-01c96cf7e5dadd8d9",
        ]
      + tags                     = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.
awscc_pcs_compute_node_group.login: Creating...
awscc_pcs_compute_node_group.login: Still creating... [10s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [20s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [30s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [40s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [50s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [1m0s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [1m10s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [1m20s elapsed]
awscc_pcs_compute_node_group.login: Still creating... [1m30s elapsed]
awscc_pcs_compute_node_group.login: Creation complete after 1m36s [id=arn:aws:pcs:us-east-1:204034886740:cluster/pcs_xg3mmgdci7/computenodegroup/pcs_64c8i88pho]
```